In [1]:
import numpy as np 
import pandas as pd 
from pandas import Series,DataFrame

In [3]:
dframe=DataFrame({'k1':['X','X','Y','Y','Z'],'k2':['alpha','beta','alpha','beta','alpha'],'dataset1':np.random.randn(5),'dataset2':np.random.randn(5)})

In [4]:
dframe

  k1     k2  dataset1  dataset2
0  X  alpha  0.855680 -0.572851
1  X   beta -0.370647  1.423412
2  Y  alpha  1.168245  0.602143
3  Y   beta  0.719267 -0.365889
4  Z  alpha  0.775195  0.083660

In [8]:
group1=dframe['dataset1'].groupby(dframe['k1'])

In [10]:
group1

In [11]:
group1.mean()

k1
X    0.242517
Y    0.943756
Z    0.775195
Name: dataset1, dtype: float64

In [12]:
cities=np.array(['ny','la','la','ny','ny']) 
month =np.array(['jan','feb','jan','feb','jan'])

In [13]:
dframe['dataset1'].groupby([cities,month]).mean()

la  feb   -0.370647
    jan    1.168245
ny  feb    0.719267
    jan    0.815438
Name: dataset1, dtype: float64

In [14]:
dframe

  k1     k2  dataset1  dataset2
0  X  alpha  0.855680 -0.572851
1  X   beta -0.370647  1.423412
2  Y  alpha  1.168245  0.602143
3  Y   beta  0.719267 -0.365889
4  Z  alpha  0.775195  0.083660

In [15]:
dframe.groupby('k1').mean()

    dataset1  dataset2
k1
X   0.242517  0.425281
Y   0.943756  0.118127
Z   0.775195  0.083660

In [16]:
dframe.groupby(['k1','k2']).mean()

          dataset1  dataset2
k1 k2
X  alpha  0.855680 -0.572851
   beta  -0.370647  1.423412
Y  alpha  1.168245  0.602143
   beta   0.719267 -0.365889
Z  alpha  0.775195  0.083660

In [17]:
dframe.groupby(['k1']).size()

k1
X    2
Y    2
Z    1
dtype: int64

In [18]:
dframe

  k1     k2  dataset1  dataset2
0  X  alpha  0.855680 -0.572851
1  X   beta -0.370647  1.423412
2  Y  alpha  1.168245  0.602143
3  Y   beta  0.719267 -0.365889
4  Z  alpha  0.775195  0.083660

In [23]:
for name,group in dframe.groupby('k1'):
    print ("This is the %s group" %name )
    print (group )
    print ('\n')

This is the X group
  k1     k2  dataset1  dataset2
0  X  alpha  0.855680 -0.572851
1  X   beta -0.370647  1.423412


This is the Y group
  k1     k2  dataset1  dataset2
2  Y  alpha  1.168245  0.602143
3  Y   beta  0.719267 -0.365889


This is the Z group
  k1     k2  dataset1  dataset2
4  Z  alpha  0.775195   0.08366

In [27]:
for (k1, k2), group in dframe.groupby(['k1','k2']):
    print ("KEY1 =%s KEY2 = %s" %(k1,k2))
    print(group)
    print ('\n')

KEY1 =X KEY2 = alpha
  k1     k2  dataset1  dataset2
0  X  alpha   0.85568 -0.572851


KEY1 =X KEY2 = beta
  k1    k2  dataset1  dataset2
1  X  beta -0.370647  1.423412


KEY1 =Y KEY2 = alpha
  k1     k2  dataset1  dataset2
2  Y  alpha  1.168245  0.602143


KEY1 =Y KEY2 = beta
  k1    k2  dataset1  dataset2
3  Y  beta  0.719267 -0.365889


KEY1 =Z KEY2 = alpha
  k1     k2  dataset1  dataset2
4  Z  alpha  0.775195   0.08366

In [28]:
group_dict = dict(list(dframe.groupby('k1')))

In [30]:
group_dict['X']

  k1     k2  dataset1  dataset2
0  X  alpha  0.855680 -0.572851
1  X   beta -0.370647  1.423412

In [31]:
group_dict_Axis1=dict(list(dframe.groupby(dframe.dtypes,axis=1)))

group_dict_Axis1

{dtype('float64'):    dataset1  dataset2
 0  0.855680 -0.572851
 1 -0.370647  1.423412
 2  1.168245  0.602143
 3  0.719267 -0.365889
 4  0.775195  0.083660,
 dtype('O'):   k1     k2
 0  X  alpha
 1  X   beta
 2  Y  alpha
 3  Y   beta
 4  Z  alpha}

In [35]:
dataset2_group = dframe.groupby(['k1','k2'])[['dataset2']]


dataset2_group.mean()

          dataset2
k1 k2
X  alpha -0.572851
   beta   1.423412
Y  alpha  0.602143
   beta  -0.365889
Z  alpha  0.083660